# Чтение и запись данных, часть 2

## Практическая работа 

### Описание практической работы и формат сдачи

Выполните предложенные задачи: впишите свой код в ячейки после комментария `### YOUR CODE HERE ###` и сохраните изменения, используя опцию *Save and Checkpoint* из вкладки меню *File* или кнопку *Save and Checkpoint* на панели инструментов. Итоговый файл в формате `.ipynb` (файл Jupyter Notebook) загрузите в личный кабинет и отправьте на проверку.

In [1]:
import pandas as pd
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import pymongo

### Задача 1

Используя сервис WeatherAPI, получите прогноз погоды в Лондоне на следующие 2 дня. Ответ преобразуйте к типу JSON.

In [10]:
api_key = '56854f1f08c8483daa682632221309'
url = f'http://api.weatherapi.com/v1/forecast.json?key={api_key}&q=London&days=2&aqi=no&alerts=no'
with req.urlopen(url) as session:
    response = session.read().decode()
    london = json.loads(response)
df_london = pd.DataFrame(london)
#forecast = df_london.loc['forecastday': , 'forecast']

### Задача 2

Сохраните данные погоды, полученные в предыдущей задаче, в файл `weather.json`. При сохранении используйте четыре пробела для форматирования.

In [92]:
with open('weather.json', 'w') as file:
    json.dump(london, file, indent=4)

### Задача 3

Из содержимого файла `weather.json` получите **почасовой** прогноз погоды, загрузите его в DataFrame и выведите первые пять строк DataFrame на экран.

In [162]:
with open('weather.json', 'r') as file:
    lond = json.load(file)
lond_days = []
for day in range(2):
    lond_days.append(lond['forecast']['forecastday'][day]['hour'])
lond_days = [col[i] for col in lond_days for i in range(len(col))]
df = pd.DataFrame(lond_days)
df.head(5)

,time_epoch,time,temp_c,temp_f,is_day,condition,wind_mph,wind_kph,wind_degree,wind_dir,...,dewpoint_f,will_it_rain,chance_of_rain,will_it_snow,chance_of_snow,vis_km,vis_miles,gust_mph,gust_kph,uv
0,1663023600,2022-09-13 00:00,20.5,68.9,0,"{'text': 'Partly cloudy', 'icon': '//cdn.weath...",1.8,2.9,273,W,...,57.9,0,0,0,0,10.0,6.0,2.9,4.7,1.0
1,1663027200,2022-09-13 01:00,20.2,68.4,0,"{'text': 'Partly cloudy', 'icon': '//cdn.weath...",4.9,7.9,15,NNE,...,58.5,0,0,0,0,10.0,6.0,8.3,13.3,1.0
2,1663030800,2022-09-13 02:00,19.7,67.5,0,"{'text': 'Partly cloudy', 'icon': '//cdn.weath...",3.6,5.8,18,NNE,...,59.7,0,0,0,0,10.0,6.0,5.6,9.0,1.0
3,1663034400,2022-09-13 03:00,19.5,67.1,0,"{'text': 'Partly cloudy', 'icon': '//cdn.weath...",5.4,8.6,25,NNE,...,60.6,0,0,0,0,10.0,6.0,7.8,12.6,1.0
4,1663038000,2022-09-13 04:00,19.0,66.2,0,"{'text': 'Cloudy', 'icon': '//cdn.weatherapi.c...",6.9,11.2,22,NNE,...,61.2,0,0,0,0,10.0,6.0,9.8,15.8,1.0

### Задача 4

Сохраните DataFrame из предыдущей задачи в файл `result.csv`. В качестве названия столбца-индекса используйте `index`.

In [163]:
df.to_csv('result.csv', index_label = 'index')

### Задача 5

Загрузите содержимое SQL-таблицы `ratings` в DataFrame. Выведите первые пять строк DataFrame на экран. Для подключения к БД используйте строку подключения, указанную в следующей ячейке.

In [167]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()
df_ratings = pd.read_sql('select * from ratings', connect)
df_ratings.head(5)

   userid  movieid  rating  timestamp
0    1909     1573     4.0  963338448
1    1909     1580     3.0  963338448
2    1909     1617     5.0  963337960
3    1909     1653     3.0  963338190
4    1909     1676     3.0  963338539

### Задача 6

Сохраните первые 10000 записей датафрейма из предыдущей задачи в файл `result2.xlsx`, при сохранении задайте листу имя `MySheet`.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр `sheet_name`)

In [168]:
df_ratings.head(1000).to_excel('result2.xlsx', sheet_name = 'MySheet')

### Задача 7

Определите количество документов в коллекции `users` в MongoDB. Если количество документов < 1000, то в следующей ячейке загрузите всё содержимое этой коллекции в список и выведите нулевой элемент этого списка на экран. Для подключения к MongoDB используйте строку подключения, указанную в следующей ячейке.

In [170]:
conn = 'mongodb://students:X63673t47Gl03Sq@dsstudents.skillbox.ru:27017/?authSource=movies'

connect = pymongo.MongoClient(conn)
db = connect['movies']
users = db['users']
users.find().count()

C:\Users\Орлан\AppData\Local\Temp\ipykernel_14372\1601044568.py:6: DeprecationWarning: count is deprecated. Use Collection.count_documents instead.
  users.find().count()

100

In [174]:
users_list = list(users.find())
users_list[0]

{'_id': ObjectId('5cc69095067496679c74f7a4'),
 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892',
 'first_name': 'Жанна',
 'last_name': 'Петрова',
 'mail': 'zhanna_03816@gmail.com',
 'age': 20.0}

### Задача 8

Преобразуйте список всех документов коллекции `users` из предыдущей задачи в pandas DataFrame и сохраните его содержимое в файл `result3.xlsx`.

In [176]:
df_users = pd.DataFrame(users_list)
df_users.to_excel('result3.xlsx')

## Дополнительные (необязательные) задачи

### Задача 9

Используя данные SQL-таблицы `ratings`, для каждого пользователя (столбец `userid`) определите средний рейтинг, который этот пользователь поставил фильмам. Результат выведите на экран. 

Группировку проведите двумя способами: с помощью `GROUP BY` в строке запроса к БД и с использованием метода `groupby` в pandas.

Для подключения к БД используйте строку подключения в следующей ячейке

In [181]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
df_raiting_avg = pd.read_sql('select userid, avg(rating) as average_rating from ratings group by userid', connect)
df_raiting_avg.sort_values(by='userid')

      userid  average_rating
5840       1        4.277778
4130       2        3.318182
7138       3        3.100000
525        4        3.500000
282        5        4.269231
...      ...             ...
1906    7952        3.390244
3728    7953        3.567568
6399    7954        3.750000
6973    7955        4.150000
2274    7956        3.290640

[7956 rows x 2 columns]

In [182]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
df_raiting_avg = pd.read_sql('select * from ratings', connect)
df_raiting_avg.groupby('userid')['rating'].mean().reset_index()

      userid    rating
0          1  4.277778
1          2  3.318182
2          3  3.100000
3          4  3.500000
4          5  4.269231
...      ...       ...
7951    7952  3.390244
7952    7953  3.567568
7953    7954  3.750000
7954    7955  4.150000
7955    7956  3.290640

[7956 rows x 2 columns]

### Задача 10

Объедините таблицы `ratings` и `keywords` по столбцам `movieid` (используйте левое объединение). Объединение проведите двумя способами: с помощью `LEFT JOIN` в строке запроса к БД и с использованием метода `merge` в pandas. Результат объединения загрузите в DataFrame и сохраните в файл `result4.csv`.

Обратите внимание, что при объединении возможно дублирование столбцов. В результирующем датафрейме не должно быть таких дублированных столбцов.

In [190]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()

df_rating_keyword = pd.read_sql('select userid, rating, timestamp, keywords.movieid, keywords.tags from ratings left join keywords on ratings.movieid = keywords.movieid', connect)
df_rating_keyword.head(5)

,userid,rating,timestamp,movieid,tags
0,1909,3.0,963338448,1580.0,"[{'id': 3152, 'name': 'planned murder'}, {'id'..."
1,1909,3.0,963338448,1580.0,"[{'id': 3152, 'name': 'planned murder'}, {'id'..."
2,1909,5.0,963338343,2117.0,"[{'id': 836, 'name': 'resistance'}, {'id': 212..."
3,1909,5.0,963338343,2117.0,"[{'id': 836, 'name': 'resistance'}, {'id': 212..."
4,1909,3.0,963338567,NaN,None

In [191]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
df_ratings = pd.read_sql('select * from ratings', connect)
df_keywords = pd.read_sql('select * from keywords', connect)
df_ratings_keywords = df_ratings.merge(df_keywords, how = 'left', on = 'movieid')
df_ratings_keywords.head(5)

,userid,movieid,rating,timestamp,tags
0,1909,1573,4.0,963338448,"[{'id': 502, 'name': 'ambush'}, {'id': 720, 'n..."
1,1909,1573,4.0,963338448,"[{'id': 502, 'name': 'ambush'}, {'id': 720, 'n..."
2,1909,1580,3.0,963338448,"[{'id': 3152, 'name': 'planned murder'}, {'id'..."
3,1909,1580,3.0,963338448,"[{'id': 3152, 'name': 'planned murder'}, {'id'..."
4,1909,1617,5.0,963337960,NaN

In [192]:
df_ratings_keywords.to_csv('result4.csv')

### Задача 11

Используя объединенную таблицу из предыдущего задания, найдите все идентификаторы фильмов с тегом `africa` (но не `south africa` или любые другие). Список тегов в формате JSON записан в столбце `tags`.

In [203]:
df_ratings_keywords[df_ratings_keywords['tags'].str.contains('africa') == True].head(5)

,userid,movieid,rating,timestamp,tags
222,1914,494,3.0,858828404,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
223,1914,494,3.0,858828404,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
241,1915,6934,4.0,1487945666,"[{'id': 740, 'name': 'aids'}, {'id': 1960, 'na..."
242,1915,6934,4.0,1487945666,"[{'id': 740, 'name': 'aids'}, {'id': 1960, 'na..."
868,1923,494,4.0,858334329,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."